app/controllers/api/api_keys_controller.rb

INSERT INTO `api_keys` (`access_token`, `created_at`, `updated_at`) VALUES ('763125012a0409c52e43beccee796036', '2022-04-06 21:11:14', '2022-04-06 21:11:14')
---
  def create
    @api_key = ApiKey.create!