app/controllers/api/research_masters_controller.rb

  def show
    @research_master = ResearchMaster.find(params[:id])
---
SELECT  `research_masters`.* FROM `research_masters` WHERE `research_masters`.`id` = 26 LIMIT 1